tests/iVectorOne.Suppliers.TPIntegrationTests/ATI/Resources/RequestLog.txt

URL: https://xml.alturaspain.com/xml/xml-interface.php

**HEADERS**

Timeout: -1


**REQUEST**

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://www.opentravel.org/OTA/2003/05" xmlns="" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header /><soap:Body><ns1:OTA_HotelAvailRQ Version="v3"><POS><Source ERSP_UserID="qwcas12g" /></POS><AvailRequestSegments><AvailRequestSegment AvailReqType="AMENITIES"><StayDateRange Start="2021-09-01" Duration="P0Y0M5D" /><RoomStayCandidates><RoomStayCandidate><GuestCounts><GuestCount AgeQualifyingCode="10" Count="1" /></GuestCounts></RoomStayCandidate></RoomStayCandidates><HotelSearchCriteria><Criterion><HotelRef HotelCode="102245" /></Criterion></HotelSearchCriteria></AvailRequestSegment></AvailRequestSegments></ns1:OTA_HotelAvailRQ></soap:Body></soap:Envelope>

URL: https://xml.alturaspain.com/xml/xml-interface.php

**HEADERS**

Timeout: -1


**REQUEST**

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://www.opentravel.org/OTA/2003/05" xmlns="" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header /><soap:Body><ns1:OTA_HotelAvailRQ Version="v3"><POS><Source ERSP_UserID="qwcas12g" /></POS><AvailRequestSegments><AvailRequestSegment AvailReqType="AMENITIES"><StayDateRange Start="2021-09-01" Duration="P0Y0M5D" /><RoomStayCandidates><RoomStayCandidate><GuestCounts><GuestCount AgeQualifyingCode="10" Count="2" /></GuestCounts></RoomStayCandidate></RoomStayCandidates><HotelSearchCriteria><Criterion><HotelRef HotelCode="102245" /></Criterion></HotelSearchCriteria></AvailRequestSegment></AvailRequestSegments></ns1:OTA_HotelAvailRQ></soap:Body></soap:Envelope>

URL: https://xml.alturaspain.com/xml/xml-interface.php

**HEADERS**

Timeout: -1


**REQUEST**

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://www.opentravel.org/OTA/2003/05" xmlns="" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header /><soap:Body><ns1:OTA_HotelAvailRQ Version="v3"><POS><Source ERSP_UserID="qwcas12g" /></POS><AvailRequestSegments><AvailRequestSegment AvailReqType="AMENITIES"><StayDateRange Start="2021-09-01" Duration="P0Y0M5D" /><RoomStayCandidates><RoomStayCandidate><GuestCounts><GuestCount AgeQualifyingCode="10" Count="1" /><GuestCount AgeQualifyingCode="08" Age="8" Count="1" /></GuestCounts></RoomStayCandidate></RoomStayCandidates><HotelSearchCriteria><Criterion><HotelRef HotelCode="102245" /></Criterion></HotelSearchCriteria></AvailRequestSegment></AvailRequestSegments></ns1:OTA_HotelAvailRQ></soap:Body></soap:Envelope>

URL: https://xml.alturaspain.com/xml/xml-interface.php

**HEADERS**

Timeout: -1


**REQUEST**

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://www.opentravel.org/OTA/2003/05" xmlns="" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header /><soap:Body><ns1:OTA_HotelAvailRQ Version="v3"><POS><Source ERSP_UserID="qwcas12g" /></POS><AvailRequestSegments><AvailRequestSegment AvailReqType="AMENITIES"><StayDateRange Start="2021-09-01" Duration="P0Y0M5D" /><RoomStayCandidates><RoomStayCandidate><GuestCounts><GuestCount AgeQualifyingCode="10" Count="1" /><GuestCount AgeQualifyingCode="08" Age="1" Count="1" /></GuestCounts></RoomStayCandidate></RoomStayCandidates><HotelSearchCriteria><Criterion><HotelRef HotelCode="102245" /></Criterion></HotelSearchCriteria></AvailRequestSegment></AvailRequestSegments></ns1:OTA_HotelAvailRQ></soap:Body></soap:Envelope>

URL: https://xml.alturaspain.com/xml/xml-interface.php

**HEADERS**

Timeout: -1


**REQUEST**

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns1="http://www.opentravel.org/OTA/2003/05" xmlns="" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header /><soap:Body><ns1:OTA_HotelAvailRQ Version="v3"><POS><Source ERSP_UserID="qwcas12g" /></POS><AvailRequestSegments><AvailRequestSegment AvailReqType="AMENITIES"><StayDateRange Start="2021-09-01" Duration="P0Y0M5D" /><RoomStayCandidates><RoomStayCandidate><GuestCounts><GuestCount AgeQualifyingCode="10" Count="1" /><GuestCount AgeQualifyingCode="08" Age="8" Count="1" /><GuestCount AgeQualifyingCode="08" Age="1" Count="1" /></GuestCounts></RoomStayCandidate></RoomStayCandidates><HotelSearchCriteria><Criterion><HotelRef HotelCode="102245" /></Criterion></HotelSearchCriteria></AvailRequestSegment></AvailRequestSegments></ns1:OTA_HotelAvailRQ></soap:Body></soap:Envelope>
